#pragma once

//******************************************************************************
//
//
//      scene_title.h
//
//
//******************************************************************************
//------< インクルード >---------------------------------------------------------
#include "../GameLib/game_lib.h"
#include "common.h"
#include "audio.h"
#include "system.h"
#include "bomb.h"
#include "m_scene.h"
// namespace
using namespace GameLib;
using namespace input;
//------< 変数 >----------------------------------------------------------------
//------< クラス・構造体 >-------------------------------------------------------
//------< 定数 >----------------------------------------------------------------
//------< 関数 >----------------------------------------------------------------

// 関数のプロトタイプ宣言

void tutorial_init();
void tutorial_deinit();
void tutorial_update();
void tutorial_render();
